app/controllers/api/events_controller.rb

INSERT INTO "events" ("description", "created_at", "updated_at", "name", "start_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Waddup"], ["created_at", "2019-01-14 04:24:33.988319"], ["updated_at", "2019-01-14 04:24:33.988319"], ["name", "Bachata"], ["start_date", "2019-02-01 23:00:00"]]
INSERT INTO "tickets" ("event_id", "name", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["event_id", 30], ["name", "Ticket 1"], ["price", 2000], ["created_at", "2019-01-14 04:24:34.039316"], ["updated_at", "2019-01-14 04:24:34.039316"]]
---
    def create
      begin
        ActiveRecord::Base.transaction do
          event = Event.create!(
            name: create_params[:name],
            event_type: create_params[:event_type],
            description: create_params[:description],
            start_date: create_params[:start_date]
          )

          create_params[:tickets].each do |ticket|
            if ticket[:name].present?
              Ticket.create!(
                price: ticket[:price].to_f * 100,
                name: ticket[:name],
                event_id: event.id
              )

SELECT  "events".* FROM "events" ORDER BY "events"."start_date" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  "events".* FROM "events" ORDER BY "events"."start_date" DESC LIMIT $1  [["LIMIT", 11]]
---
    def index
      begin
        events = Event.order(start_date: :desc)

        if index_params[:latest]
          events = [events.last]
        end

        render json: { events: events.map(&:serialized) }, status: :created